app/Http/Controllers/BerandaController.php

    public function index()
    {
        $title ='';
        if (request('category')) {
            $category = Category::firstWhere('slug', request('category'));
            $title = ' in ' . $category->name;
        }

        return view('beranda', [
            "title" => "Home" . $title,
            "active" => "home",
            "beranda" => Beranda::latest()->filter(request(['search', 'category']))->paginate(7)->withQueryString()
        ]);
---
SELECT * FROM `categories` WHERE `slug` = 'kategori-Sleeping-Bag' LIMIT 1
SELECT * FROM `berandas` ORDER BY `created_at` DESC LIMIT 7 offset 0
SELECT * FROM `categories` WHERE `categories`.`id` in (1, 2, 3)
SELECT count(*) as aggregate FROM `berandas`
SELECT * FROM `categories` WHERE `categories`.`id` in (1, 2, 3, 4)

    public function show(Beranda $home) //route model binding
    {
        return view('home', [
            "title" => "single post",
            "active" => "home",
            "beranda" => $home,
            "paymentmethod" => PaymentMethod::all(),
---
SELECT * FROM `payment_methods`

    public function pinjam(Request $request) {

        $validate = Validator::make($request->all(),[
            'tgl_pinjam' => 'required',
            'tgl_kembali' => 'required',
            // 'payment_method ' => 'required',
        ]);

        if($validate->fails()) {
            return back()
                    ->withInput()
                    ->with('pinjam_error', 'error')
                    ->withErrors($validate->errors());
                    // ->with('errors', $validate->errors());
        } else {

            $produk = Post::find($request->beranda_id);

            $jml_stok = $produk->stok - 1;

            if($jml_stok < 0) {
                return back()->with('error', 'Stok tidak ada');
            } else {
                $ber = Post::find($request->beranda_id);
                $ber->stok = $jml_stok;
                $ber->save();
---
SELECT * FROM `berandas` WHERE `berandas`.`id` = '1' LIMIT 1
UPDATE `berandas` SET `stok` = 8, `berandas`.`updated_at` = '2022-07-19 17:21:13' WHERE `id` = 1

                $pay->transaction_id = $trans->id;
                $pay->payment_method_id = $request->payment_method;
                $pay->payment_status = 'unpaid';
                $pay->save();
---
INSERT INTO `payments` (`transaction_id`, `payment_method_id`, `payment_status`, `updated_at`, `created_at`) VALUES (2, '1', 'unpaid', '2022-07-19 17:21:13', '2022-07-19 17:21:13')

    public function transaksi() {
        return view('transaction',[
            "title" => "Transaksi",
            "active" => "home",
            'transaction' => Transaction::with('post')->where('user_id', session()->get('id_user'))->latest()->get(),
---
SELECT * FROM `transactions` WHERE `user_id` = 2 ORDER BY `created_at` DESC

    public function transaksi_show($code) {
        $trans = Transaction::with(['user','post'])->where('code', $code)->first();
        $payment = Payment::with('paymentmethod')->where('transaction_id', $trans->id)->first();
---
SELECT * FROM `transactions` WHERE `code` = 'AO-1658251273' LIMIT 1
SELECT * FROM `users` WHERE `users`.`id` in (2)
SELECT * FROM `payment_methods` WHERE `payment_methods`.`id` in (1)
SELECT * FROM `payments` WHERE `transaction_id` = 2 LIMIT 1

    public function profile() {
        return view('profile',[
            "title" => "Profile",
            "active" => "home",
            'user' => User::find(session()->get('id_user')),
---
SELECT * FROM `users` WHERE `users`.`id` = 2 LIMIT 1