app/Http/Controllers/CategoryController.php

    public function index()
    {
        return view('categories',[
            'title' => 'Categories',
            'active' => 'categories',
            'categories' => Category::all()
        ]);
---
SELECT * FROM `categories`