app/Http/Controllers/DashboardUserController.php

SELECT * FROM `users`
---
    public function index()
    {
        return view('admin.users.index',[
            'users' => User::all()
        ]);