app/Http/Controllers/DashboardDendaController.php

SELECT * FROM `dendas` ORDER BY `created_at` DESC
---
    public function index() {
        return view('admin.denda.index',[
            'denda' => Denda::with('transaction')->latest()->get(),
        ]);