app/Http/Controllers/DashboardTransactionController.php

SELECT * FROM `transactions` ORDER BY `created_at` DESC
SELECT * FROM `users` WHERE `users`.`id` in (2)
---
    public function index() {
        return view('admin.transaction.index',[
            'transaction' => Transaction::with(['post','user'])->latest()->get(),
        ]);

SELECT * FROM `transactions` WHERE `code` = 'AO-1657543881' LIMIT 1
SELECT * FROM `users` WHERE `users`.`id` in (2)
SELECT * FROM `payment_methods` WHERE `payment_methods`.`id` in (1)
SELECT * FROM `payments` WHERE `transaction_id` = 1 LIMIT 1
---
    public function show($code) {
        $transaksi = Transaction::with(['post','user'])->where('code', $code)->first();
        $payment = Payment::with('PaymentMethod')->where('transaction_id', $transaksi->id)->first();