app/Http/Controllers/DashboardCategoryController.php

    public function index()
    {
        return view('admin.categories.index', [
            'categories' => Category::all()
        ]);
---
SELECT * FROM `categories`