app/Http/Controllers/DashboardAdminController.php

    public function admin(){
        return view('admin.admin',[
            'jml_post' => Post::all()->count(),
            'jml_category' => Category::all()->count(),
            'jml_payment_method' => PaymentMethod::all()->count(),
            'jml_transaction' => Transaction::all()->count(),
            'jml_denda' => Denda::all()->count(),
            'jml_user' => User::all()->count(),
        ]);
---
SELECT * FROM `transactions`
SELECT * FROM `dendas`
SELECT * FROM `payment_methods`
SELECT * FROM `categories`