app/Http/Controllers/DashboardPostController.php

SELECT * FROM `berandas`
---
    public function index()
    {
        return view('admin.posts.index', [
            'posts' => Beranda::all()
        ]);