app/Http/Controllers/DashboardPaymentMethodController.php

SELECT * FROM `payment_methods`
---
    public function index() {
        return view('admin.payment-method.index',[
            'paymentmethod' => PaymentMethod::all(),
        ]);