app/Http/Controllers/LoginController.php

    public function authenticate(Request $request)
    {
        $credentials = $request->validate([
            'email'=> 'required|email:dns',
            'password'=> 'required'
        ]);

        // if (Auth::attempt($credentials)) {
        //     $request->session()->regenerate();
        //     return redirect()->intended('/');
        // }

        $user = User::where('email','=',$credentials['email'])->first();
---
SELECT * FROM `users` WHERE `email` = 'admin@gmail.com' LIMIT 1