app/Models/Beranda.php

    public function scopeFilter($query, array $filters)
    { //query scope

        $query->when($filters['search'] ?? false, function ($query, $search) {
            return $query->where(function ($query) use ($search) {
                $query->where('title', 'like', '%' . $search . '%')
                    ->orWhere('body', 'like', '%' . $search . '%');
            });
        });
        //dump($query);


        $key = Beranda::select("*")->get();
---
SELECT * FROM `berandas`